GopalSaraf/Practicals/PSDL/include/proc/pic16lf18876.h
// Register: SMT2CPWU
#define SMT2CPWU SMT2CPWU
extern volatile unsigned char           SMT2CPWU            __at(0x514);
#ifndef _LIB_BUILD
asm("SMT2CPWU equ 0514h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPW                    :8;
    };
    struct {
        unsigned CPW16                  :1;
        unsigned CPW17                  :1;
        unsigned CPW18                  :1;
        unsigned CPW19                  :1;
        unsigned CPW20                  :1;
        unsigned CPW21                  :1;
        unsigned CPW22                  :1;
        unsigned CPW23                  :1;
    };
    struct {
        unsigned SMT2CPW                :8;
    };
    struct {
        unsigned SMT2CPW16              :1;
        unsigned SMT2CPW17              :1;
        unsigned SMT2CPW18              :1;
        unsigned SMT2CPW19              :1;
        unsigned SMT2CPW20              :1;
        unsigned SMT2CPW21              :1;
        unsigned SMT2CPW22              :1;
        unsigned SMT2CPW23              :1;
    };
} SMT2CPWUbits_t;
extern volatile SMT2CPWUbits_t SMT2CPWUbits __at(0x514);
// bitfield macros
#define _SMT2CPWU_CPW_POSN                                  0x0
#define _SMT2CPWU_CPW_POSITION                              0x0
#define _SMT2CPWU_CPW_SIZE                                  0x8
#define _SMT2CPWU_CPW_LENGTH                                0x8
#define _SMT2CPWU_CPW_MASK                                  0xFF
#define _SMT2CPWU_CPW16_POSN                                0x0
#define _SMT2CPWU_CPW16_POSITION                            0x0
#define _SMT2CPWU_CPW16_SIZE                                0x1
#define _SMT2CPWU_CPW16_LENGTH                              0x1
#define _SMT2CPWU_CPW16_MASK                                0x1
#define _SMT2CPWU_CPW17_POSN                                0x1
#define _SMT2CPWU_CPW17_POSITION                            0x1
#define _SMT2CPWU_CPW17_SIZE                                0x1
#define _SMT2CPWU_CPW17_LENGTH                              0x1
#define _SMT2CPWU_CPW17_MASK                                0x2
#define _SMT2CPWU_CPW18_POSN                                0x2
#define _SMT2CPWU_CPW18_POSITION                            0x2
#define _SMT2CPWU_CPW18_SIZE                                0x1
#define _SMT2CPWU_CPW18_LENGTH                              0x1
#define _SMT2CPWU_CPW18_MASK                                0x4
#define _SMT2CPWU_CPW19_POSN                                0x3
#define _SMT2CPWU_CPW19_POSITION                            0x3
#define _SMT2CPWU_CPW19_SIZE                                0x1
#define _SMT2CPWU_CPW19_LENGTH                              0x1
#define _SMT2CPWU_CPW19_MASK                                0x8
#define _SMT2CPWU_CPW20_POSN                                0x4
#define _SMT2CPWU_CPW20_POSITION                            0x4
#define _SMT2CPWU_CPW20_SIZE                                0x1
#define _SMT2CPWU_CPW20_LENGTH                              0x1
#define _SMT2CPWU_CPW20_MASK                                0x10
#define _SMT2CPWU_CPW21_POSN                                0x5
#define _SMT2CPWU_CPW21_POSITION                            0x5
#define _SMT2CPWU_CPW21_SIZE                                0x1
#define _SMT2CPWU_CPW21_LENGTH                              0x1
#define _SMT2CPWU_CPW21_MASK                                0x20
#define _SMT2CPWU_CPW22_POSN                                0x6
#define _SMT2CPWU_CPW22_POSITION                            0x6
#define _SMT2CPWU_CPW22_SIZE                                0x1
#define _SMT2CPWU_CPW22_LENGTH                              0x1
#define _SMT2CPWU_CPW22_MASK                                0x40
#define _SMT2CPWU_CPW23_POSN                                0x7
#define _SMT2CPWU_CPW23_POSITION                            0x7
#define _SMT2CPWU_CPW23_SIZE                                0x1
#define _SMT2CPWU_CPW23_LENGTH                              0x1
#define _SMT2CPWU_CPW23_MASK                                0x80
#define _SMT2CPWU_SMT2CPW_POSN                              0x0
#define _SMT2CPWU_SMT2CPW_POSITION                          0x0
#define _SMT2CPWU_SMT2CPW_SIZE                              0x8
#define _SMT2CPWU_SMT2CPW_LENGTH                            0x8
#define _SMT2CPWU_SMT2CPW_MASK                              0xFF
#define _SMT2CPWU_SMT2CPW16_POSN                            0x0
#define _SMT2CPWU_SMT2CPW16_POSITION                        0x0
#define _SMT2CPWU_SMT2CPW16_SIZE                            0x1
#define _SMT2CPWU_SMT2CPW16_LENGTH                          0x1
#define _SMT2CPWU_SMT2CPW16_MASK                            0x1
#define _SMT2CPWU_SMT2CPW17_POSN                            0x1
#define _SMT2CPWU_SMT2CPW17_POSITION                        0x1
#define _SMT2CPWU_SMT2CPW17_SIZE                            0x1
#define _SMT2CPWU_SMT2CPW17_LENGTH                          0x1
#define _SMT2CPWU_SMT2CPW17_MASK                            0x2
#define _SMT2CPWU_SMT2CPW18_POSN                            0x2
#define _SMT2CPWU_SMT2CPW18_POSITION                        0x2
#define _SMT2CPWU_SMT2CPW18_SIZE                            0x1
#define _SMT2CPWU_SMT2CPW18_LENGTH                          0x1
#define _SMT2CPWU_SMT2CPW18_MASK                            0x4
#define _SMT2CPWU_SMT2CPW19_POSN                            0x3
#define _SMT2CPWU_SMT2CPW19_POSITION                        0x3
#define _SMT2CPWU_SMT2CPW19_SIZE                            0x1
#define _SMT2CPWU_SMT2CPW19_LENGTH                          0x1
#define _SMT2CPWU_SMT2CPW19_MASK                            0x8
#define _SMT2CPWU_SMT2CPW20_POSN                            0x4
#define _SMT2CPWU_SMT2CPW20_POSITION                        0x4
#define _SMT2CPWU_SMT2CPW20_SIZE                            0x1
#define _SMT2CPWU_SMT2CPW20_LENGTH                          0x1
#define _SMT2CPWU_SMT2CPW20_MASK                            0x10
#define _SMT2CPWU_SMT2CPW21_POSN                            0x5
#define _SMT2CPWU_SMT2CPW21_POSITION                        0x5
#define _SMT2CPWU_SMT2CPW21_SIZE                            0x1
#define _SMT2CPWU_SMT2CPW21_LENGTH                          0x1
#define _SMT2CPWU_SMT2CPW21_MASK                            0x20
#define _SMT2CPWU_SMT2CPW22_POSN                            0x6
#define _SMT2CPWU_SMT2CPW22_POSITION                        0x6
#define _SMT2CPWU_SMT2CPW22_SIZE                            0x1
#define _SMT2CPWU_SMT2CPW22_LENGTH                          0x1
#define _SMT2CPWU_SMT2CPW22_MASK                            0x40
#define _SMT2CPWU_SMT2CPW23_POSN                            0x7
#define _SMT2CPWU_SMT2CPW23_POSITION                        0x7
#define _SMT2CPWU_SMT2CPW23_SIZE                            0x1
#define _SMT2CPWU_SMT2CPW23_LENGTH                          0x1
#define _SMT2CPWU_SMT2CPW23_MASK                            0x80

// Register: SMT2PR
#define SMT2PR SMT2PR
#ifndef __CCI__
extern volatile __uint24                SMT2PR              __at(0x515);
#endif
#ifndef _LIB_BUILD
asm("SMT2PR equ 0515h");
#endif

// Register: SMT2PRL
#define SMT2PRL SMT2PRL
extern volatile unsigned char           SMT2PRL             __at(0x515);
#ifndef _LIB_BUILD
asm("SMT2PRL equ 0515h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned PR0                    :1;
        unsigned PR1                    :1;
        unsigned PR2                    :1;
        unsigned PR3                    :1;
        unsigned PR4                    :1;
        unsigned PR5                    :1;
        unsigned PR6                    :1;
        unsigned PR7                    :1;
    };
    struct {
        unsigned SMT2PR                 :8;
    };
    struct {
        unsigned SMT2PR0                :1;
        unsigned SMT2PR1                :1;
        unsigned SMT2PR2                :1;
        unsigned SMT2PR3                :1;
        unsigned SMT2PR4                :1;
        unsigned SMT2PR5                :1;
        unsigned SMT2PR6                :1;
        unsigned SMT2PR7                :1;
    };
} SMT2PRLbits_t;
extern volatile SMT2PRLbits_t SMT2PRLbits __at(0x515);
// bitfield macros
#define _SMT2PRL_PR_POSN                                    0x0
#define _SMT2PRL_PR_POSITION                                0x0
#define _SMT2PRL_PR_SIZE                                    0x8
#define _SMT2PRL_PR_LENGTH                                  0x8
#define _SMT2PRL_PR_MASK                                    0xFF
#define _SMT2PRL_PR0_POSN                                   0x0
#define _SMT2PRL_PR0_POSITION                               0x0
#define _SMT2PRL_PR0_SIZE                                   0x1
#define _SMT2PRL_PR0_LENGTH                                 0x1
#define _SMT2PRL_PR0_MASK                                   0x1
#define _SMT2PRL_PR1_POSN                                   0x1
#define _SMT2PRL_PR1_POSITION                               0x1
#define _SMT2PRL_PR1_SIZE                                   0x1
#define _SMT2PRL_PR1_LENGTH                                 0x1
#define _SMT2PRL_PR1_MASK                                   0x2
#define _SMT2PRL_PR2_POSN                                   0x2
#define _SMT2PRL_PR2_POSITION                               0x2
#define _SMT2PRL_PR2_SIZE                                   0x1
#define _SMT2PRL_PR2_LENGTH                                 0x1
#define _SMT2PRL_PR2_MASK                                   0x4
#define _SMT2PRL_PR3_POSN                                   0x3
#define _SMT2PRL_PR3_POSITION                               0x3
#define _SMT2PRL_PR3_SIZE                                   0x1
#define _SMT2PRL_PR3_LENGTH                                 0x1
#define _SMT2PRL_PR3_MASK                                   0x8
#define _SMT2PRL_PR4_POSN                                   0x4
#define _SMT2PRL_PR4_POSITION                               0x4
#define _SMT2PRL_PR4_SIZE                                   0x1
#define _SMT2PRL_PR4_LENGTH                                 0x1
#define _SMT2PRL_PR4_MASK                                   0x10
#define _SMT2PRL_PR5_POSN                                   0x5
#define _SMT2PRL_PR5_POSITION                               0x5
#define _SMT2PRL_PR5_SIZE                                   0x1
#define _SMT2PRL_PR5_LENGTH                                 0x1
#define _SMT2PRL_PR5_MASK                                   0x20
#define _SMT2PRL_PR6_POSN                                   0x6
#define _SMT2PRL_PR6_POSITION                               0x6
#define _SMT2PRL_PR6_SIZE                                   0x1
#define _SMT2PRL_PR6_LENGTH                                 0x1
#define _SMT2PRL_PR6_MASK                                   0x40
#define _SMT2PRL_PR7_POSN                                   0x7
#define _SMT2PRL_PR7_POSITION                               0x7
#define _SMT2PRL_PR7_SIZE                                   0x1
#define _SMT2PRL_PR7_LENGTH                                 0x1
#define _SMT2PRL_PR7_MASK                                   0x80
#define _SMT2PRL_SMT2PR_POSN                                0x0
#define _SMT2PRL_SMT2PR_POSITION                            0x0
#define _SMT2PRL_SMT2PR_SIZE                                0x8
#define _SMT2PRL_SMT2PR_LENGTH                              0x8
#define _SMT2PRL_SMT2PR_MASK                                0xFF
#define _SMT2PRL_SMT2PR0_POSN                               0x0
#define _SMT2PRL_SMT2PR0_POSITION                           0x0
#define _SMT2PRL_SMT2PR0_SIZE                               0x1
#define _SMT2PRL_SMT2PR0_LENGTH                             0x1
#define _SMT2PRL_SMT2PR0_MASK                               0x1
#define _SMT2PRL_SMT2PR1_POSN                               0x1
#define _SMT2PRL_SMT2PR1_POSITION                           0x1
#define _SMT2PRL_SMT2PR1_SIZE                               0x1
#define _SMT2PRL_SMT2PR1_LENGTH                             0x1
#define _SMT2PRL_SMT2PR1_MASK                               0x2
#define _SMT2PRL_SMT2PR2_POSN                               0x2
#define _SMT2PRL_SMT2PR2_POSITION                           0x2
#define _SMT2PRL_SMT2PR2_SIZE                               0x1
#define _SMT2PRL_SMT2PR2_LENGTH                             0x1
#define _SMT2PRL_SMT2PR2_MASK                               0x4
#define _SMT2PRL_SMT2PR3_POSN                               0x3
#define _SMT2PRL_SMT2PR3_POSITION                           0x3
#define _SMT2PRL_SMT2PR3_SIZE                               0x1
#define _SMT2PRL_SMT2PR3_LENGTH                             0x1
#define _SMT2PRL_SMT2PR3_MASK                               0x8
#define _SMT2PRL_SMT2PR4_POSN                               0x4
#define _SMT2PRL_SMT2PR4_POSITION                           0x4
#define _SMT2PRL_SMT2PR4_SIZE                               0x1
#define _SMT2PRL_SMT2PR4_LENGTH                             0x1
#define _SMT2PRL_SMT2PR4_MASK                               0x10
#define _SMT2PRL_SMT2PR5_POSN                               0x5
#define _SMT2PRL_SMT2PR5_POSITION                           0x5
#define _SMT2PRL_SMT2PR5_SIZE                               0x1
#define _SMT2PRL_SMT2PR5_LENGTH                             0x1
#define _SMT2PRL_SMT2PR5_MASK                               0x20
#define _SMT2PRL_SMT2PR6_POSN                               0x6
#define _SMT2PRL_SMT2PR6_POSITION                           0x6
#define _SMT2PRL_SMT2PR6_SIZE                               0x1
#define _SMT2PRL_SMT2PR6_LENGTH                             0x1
#define _SMT2PRL_SMT2PR6_MASK                               0x40
#define _SMT2PRL_SMT2PR7_POSN                               0x7
#define _SMT2PRL_SMT2PR7_POSITION                           0x7
#define _SMT2PRL_SMT2PR7_SIZE                               0x1
#define _SMT2PRL_SMT2PR7_LENGTH                             0x1
#define _SMT2PRL_SMT2PR7_MASK                               0x80

// Register: SMT2PRH
#define SMT2PRH SMT2PRH
extern volatile unsigned char           SMT2PRH             __at(0x516);
#ifndef _LIB_BUILD
asm("SMT2PRH equ 0516h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned PR8                    :1;
        unsigned PR9                    :1;
        unsigned PR10                   :1;
        unsigned PR11                   :1;
        unsigned PR12                   :1;
        unsigned PR13                   :1;
        unsigned PR14                   :1;
        unsigned PR15                   :1;
    };
    struct {
        unsigned SMT2PR                 :8;
    };
    struct {
        unsigned SMT2PR8                :1;
        unsigned SMT2PR9                :1;
        unsigned SMT2PR10               :1;
        unsigned SMT2PR11               :1;
        unsigned SMT2PR12               :1;
        unsigned SMT2PR13               :1;
        unsigned SMT2PR14               :1;
        unsigned SMT2PR15               :1;
    };
} SMT2PRHbits_t;
extern volatile SMT2PRHbits_t SMT2PRHbits __at(0x516);
// bitfield macros
#define _SMT2PRH_PR_POSN                                    0x0
#define _SMT2PRH_PR_POSITION                                0x0
#define _SMT2PRH_PR_SIZE                                    0x8
#define _SMT2PRH_PR_LENGTH                                  0x8
#define _SMT2PRH_PR_MASK                                    0xFF
#define _SMT2PRH_PR8_POSN                                   0x0
#define _SMT2PRH_PR8_POSITION                               0x0
#define _SMT2PRH_PR8_SIZE                                   0x1
#define _SMT2PRH_PR8_LENGTH                                 0x1
#define _SMT2PRH_PR8_MASK                                   0x1
#define _SMT2PRH_PR9_POSN                                   0x1
#define _SMT2PRH_PR9_POSITION                               0x1
#define _SMT2PRH_PR9_SIZE                                   0x1
#define _SMT2PRH_PR9_LENGTH                                 0x1
#define _SMT2PRH_PR9_MASK                                   0x2
#define _SMT2PRH_PR10_POSN                                  0x2
#define _SMT2PRH_PR10_POSITION                              0x2
#define _SMT2PRH_PR10_SIZE                                  0x1
#define _SMT2PRH_PR10_LENGTH                                0x1
#define _SMT2PRH_PR10_MASK                                  0x4
#define _SMT2PRH_PR11_POSN                                  0x3
#define _SMT2PRH_PR11_POSITION                              0x3
#define _SMT2PRH_PR11_SIZE                                  0x1
#define _SMT2PRH_PR11_LENGTH                                0x1
#define _SMT2PRH_PR11_MASK                                  0x8
#define _SMT2PRH_PR12_POSN                                  0x4
#define _SMT2PRH_PR12_POSITION                              0x4
#define _SMT2PRH_PR12_SIZE                                  0x1
#define _SMT2PRH_PR12_LENGTH                                0x1
#define _SMT2PRH_PR12_MASK                                  0x10
#define _SMT2PRH_PR13_POSN                                  0x5
#define _SMT2PRH_PR13_POSITION                              0x5
#define _SMT2PRH_PR13_SIZE                                  0x1
#define _SMT2PRH_PR13_LENGTH                                0x1
#define _SMT2PRH_PR13_MASK                                  0x20
#define _SMT2PRH_PR14_POSN                                  0x6
#define _SMT2PRH_PR14_POSITION                              0x6
#define _SMT2PRH_PR14_SIZE                                  0x1
#define _SMT2PRH_PR14_LENGTH                                0x1
#define _SMT2PRH_PR14_MASK                                  0x40
#define _SMT2PRH_PR15_POSN                                  0x7
#define _SMT2PRH_PR15_POSITION                              0x7
#define _SMT2PRH_PR15_SIZE                                  0x1
#define _SMT2PRH_PR15_LENGTH                                0x1
#define _SMT2PRH_PR15_MASK                                  0x80
#define _SMT2PRH_SMT2PR_POSN                                0x0
#define _SMT2PRH_SMT2PR_POSITION                            0x0
#define _SMT2PRH_SMT2PR_SIZE                                0x8
#define _SMT2PRH_SMT2PR_LENGTH                              0x8
#define _SMT2PRH_SMT2PR_MASK                                0xFF
#define _SMT2PRH_SMT2PR8_POSN                               0x0
#define _SMT2PRH_SMT2PR8_POSITION                           0x0
#define _SMT2PRH_SMT2PR8_SIZE                               0x1
#define _SMT2PRH_SMT2PR8_LENGTH                             0x1
#define _SMT2PRH_SMT2PR8_MASK                               0x1
#define _SMT2PRH_SMT2PR9_POSN                               0x1
#define _SMT2PRH_SMT2PR9_POSITION                           0x1
#define _SMT2PRH_SMT2PR9_SIZE                               0x1
#define _SMT2PRH_SMT2PR9_LENGTH                             0x1
#define _SMT2PRH_SMT2PR9_MASK                               0x2
#define _SMT2PRH_SMT2PR10_POSN                              0x2
#define _SMT2PRH_SMT2PR10_POSITION                          0x2
#define _SMT2PRH_SMT2PR10_SIZE                              0x1
#define _SMT2PRH_SMT2PR10_LENGTH                            0x1
#define _SMT2PRH_SMT2PR10_MASK                              0x4
#define _SMT2PRH_SMT2PR11_POSN                              0x3
#define _SMT2PRH_SMT2PR11_POSITION                          0x3
#define _SMT2PRH_SMT2PR11_SIZE                              0x1
#define _SMT2PRH_SMT2PR11_LENGTH                            0x1
#define _SMT2PRH_SMT2PR11_MASK                              0x8
#define _SMT2PRH_SMT2PR12_POSN                              0x4
#define _SMT2PRH_SMT2PR12_POSITION                          0x4
#define _SMT2PRH_SMT2PR12_SIZE                              0x1
#define _SMT2PRH_SMT2PR12_LENGTH                            0x1
#define _SMT2PRH_SMT2PR12_MASK                              0x10
#define _SMT2PRH_SMT2PR13_POSN                              0x5
#define _SMT2PRH_SMT2PR13_POSITION                          0x5
#define _SMT2PRH_SMT2PR13_SIZE                              0x1
#define _SMT2PRH_SMT2PR13_LENGTH                            0x1
#define _SMT2PRH_SMT2PR13_MASK                              0x20
#define _SMT2PRH_SMT2PR14_POSN                              0x6
#define _SMT2PRH_SMT2PR14_POSITION                          0x6
#define _SMT2PRH_SMT2PR14_SIZE                              0x1
#define _SMT2PRH_SMT2PR14_LENGTH                            0x1
#define _SMT2PRH_SMT2PR14_MASK                              0x40
#define _SMT2PRH_SMT2PR15_POSN                              0x7
#define _SMT2PRH_SMT2PR15_POSITION                          0x7
#define _SMT2PRH_SMT2PR15_SIZE                              0x1
#define _SMT2PRH_SMT2PR15_LENGTH                            0x1
#define _SMT2PRH_SMT2PR15_MASK                              0x80

// Register: SMT2PRU
#define SMT2PRU SMT2PRU
extern volatile unsigned char           SMT2PRU             __at(0x517);
#ifndef _LIB_BUILD
asm("SMT2PRU equ 0517h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned PR16                   :1;
        unsigned PR17                   :1;
        unsigned PR18                   :1;
        unsigned PR19                   :1;
        unsigned PR20                   :1;
        unsigned PR21                   :1;
        unsigned PR22                   :1;
        unsigned PR23                   :1;
    };
    struct {
        unsigned SMT2PR                 :8;
    };
    struct {
        unsigned SMT2PR16               :1;
        unsigned SMT2PR17               :1;
        unsigned SMT2PR18               :1;
        unsigned SMT2PR19               :1;
        unsigned SMT2PR20               :1;
        unsigned SMT2PR21               :1;
        unsigned SMT2PR22               :1;
        unsigned SMT2PR23               :1;
    };
} SMT2PRUbits_t;
